In [2]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [3]:
#install pyreadstat to be able to read '.sav' extension
!pip install pyreadstat

Requirement already satisfied: pyreadstat in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (1.1.4)
Requirement already satisfied: pandas>=1.2.0 in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (from pyreadstat) (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (from pandas>=1.2.0->pyreadstat) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (from pandas>=1.2.0->pyreadstat) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (from pandas>=1.2.0->pyreadstat) (1.20.1)
Requirement already satisfied: six>=1.5 in /Users/niitettehodoi/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas>=1.2.0->pyreadstat) (1.15.0)

In [6]:
df = pd.read_spss('./1ResearchProjectData.sav')

In [7]:
df.head()

   Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
0      1.0   Ruger  Female             Asian  Free lunch   76.0  Ruger_Smith
1      2.0   Ruger  Female          Hispanic  Paid lunch   56.0  Ruger_Smith
2      3.0   Ruger  Female  African-American  Free lunch   34.0  Ruger_Smith
3      4.0   Ruger  Female             Asian  Paid lunch   59.0  Ruger_Smith
4      5.0   Ruger    Male          Hispanic  Free lunch   73.0  Ruger_Smith

In [8]:
df.index

RangeIndex(start=0, stop=217, step=1)

In [9]:
df.tail()

     Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
212    213.0  Wesson    Male          Hispanic  Free lunch   94.0       Wesson
213    214.0  Wesson    Male          Hispanic  Paid lunch   91.0       Wesson
214    215.0  Wesson  Female  African-American  Paid lunch   53.0       Wesson
215    216.0  Wesson    Male          Hispanic  Paid lunch   57.0       Wesson
216      NaN     NaN     NaN               NaN         NaN    NaN  Ruger_Smith

In [10]:
df.describe()

       Student       Score
count  216.000  216.000000
mean   108.500   65.273148
std     62.498   16.361453
min      1.000   30.000000
25%     54.750   53.000000
50%    108.500   65.000000
75%    162.250   79.000000
max    216.000   95.000000

In [11]:
#to remove the last row that is empty
df = df.loc[:215,:]

In [12]:
df.tail()

     Student Teacher  Gender            Ethnic    Freeredu  Score  wesson
211    212.0  Wesson    Male  African-American  Paid lunch   56.0  Wesson
212    213.0  Wesson    Male          Hispanic  Free lunch   94.0  Wesson
213    214.0  Wesson    Male          Hispanic  Paid lunch   91.0  Wesson
214    215.0  Wesson  Female  African-American  Paid lunch   53.0  Wesson
215    216.0  Wesson    Male          Hispanic  Paid lunch   57.0  Wesson

In [13]:
#returns the number of missing values in each column
df.isna().sum()

Student     0
Teacher     0
Gender      0
Ethnic      0
Freeredu    0
Score       0
wesson      0
dtype: int64

In [14]:
teachers = df.Teacher.unique()
teachers

['Ruger', 'Smith', 'Wesson']
Categories (3, object): ['Ruger', 'Smith', 'Wesson']

In [15]:
race = df.Ethnic.unique()
race

['Asian', 'Hispanic', 'African-American', 'Caucasian']
Categories (4, object): ['Asian', 'Hispanic', 'African-American', 'Caucasian']

In [16]:
lunch_type = df.Freeredu.unique()
lunch_type

['Free lunch', 'Paid lunch']
Categories (2, object): ['Free lunch', 'Paid lunch']

In [17]:
teaching_method = df.wesson.unique()
teaching_method

['Ruger_Smith', 'Wesson']
Categories (2, object): ['Ruger_Smith', 'Wesson']

In [18]:
#Teaching method list
standards_based_method = df[df.wesson == 'Ruger_Smith']
traditional_based_method = df[df.wesson == 'Wesson']

In [19]:
standards_based_method.head()

   Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
0      1.0   Ruger  Female             Asian  Free lunch   76.0  Ruger_Smith
1      2.0   Ruger  Female          Hispanic  Paid lunch   56.0  Ruger_Smith
2      3.0   Ruger  Female  African-American  Free lunch   34.0  Ruger_Smith
3      4.0   Ruger  Female             Asian  Paid lunch   59.0  Ruger_Smith
4      5.0   Ruger    Male          Hispanic  Free lunch   73.0  Ruger_Smith

In [20]:
traditional_based_method.head()

     Student Teacher  Gender            Ethnic    Freeredu  Score  wesson
140    141.0  Wesson    Male         Caucasian  Paid lunch   51.0  Wesson
141    142.0  Wesson    Male          Hispanic  Free lunch   71.0  Wesson
142    143.0  Wesson    Male  African-American  Free lunch   77.0  Wesson
143    144.0  Wesson  Female             Asian  Paid lunch   85.0  Wesson
144    145.0  Wesson  Female         Caucasian  Paid lunch   89.0  Wesson

Results By Teaching Method

In [21]:
standards_based_method.describe()

        Student       Score
count  140.0000  140.000000
mean    70.5000   62.335714
std     40.5586   16.678341
min      1.0000   30.000000
25%     35.7500   50.750000
50%     70.5000   64.000000
75%    105.2500   74.000000
max    140.0000   95.000000

In [22]:
traditional_based_method.describe()

          Student      Score
count   76.000000  76.000000
mean   178.500000  70.684211
std     22.083176  14.355682
min    141.000000  45.000000
25%    159.750000  58.000000
50%    178.500000  70.000000
75%    197.250000  83.000000
max    216.000000  94.000000

In [23]:
standards_based_method_Score_mean = standards_based_method.Score.mean()
standards_based_method_Score_mean

62.33571428571429

In [24]:
traditional_based_method_Score_mean = traditional_based_method.Score.mean()
traditional_based_method_Score_mean

70.6842105263158

In [37]:
standards_based_method_max = standards_based_method.Score.max()
standards_based_method_max

95.0

In [26]:
traditional_based_method_max = traditional_based_method.Score.max()
traditional_based_method_max

94.0

# Summary

In conclusion, traditional method resulted in higher maths score for students with the average score attained by students being 70.68 as compared to the standards method that averaged 62.33.
Also, students taught using the traditional method got as high as 94 as their score and the standards method got student to score as high as 95, which is just a mark more than what was attained with the tranditional method.
With the above, I suggest the traditional method (Weeson) should be adopted by the school as the teaching method since it yields the best outcome.